# Taps
tap "aws/tap"
tap "candid82/brew"
tap "cmacrae/formulae"
tap "craciuncezar/tap"
tap "khanhas/tap"

#: Core CLI Tools
brew "automake"
brew "fish"
brew "helix"
brew "mise"
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "curl"
brew "duti"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "gnupg"
brew "go"
brew "btop"
brew "hub"
brew "jq"
brew "yq"
brew "lazydocker"
brew "lazygit"
brew "bottom"
brew "dust"
brew "procs"
brew "zoxide"
brew "zellij"
brew "httpie"
brew "jless"
brew "glow"
brew "openssl@3"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "sqlite"
brew "todo-txt"
brew "tree"
brew "uv"
brew "wget"
brew "himalaya"
brew "khal"
brew "vdirsyncer"
brew "typst"

#: Critical System Tools
cask "1password"
cask "1password-cli"
cask "karabiner-elements"
cask "raycast"

#: Development Environment
cask "ghostty"
cask "visual-studio-code"
cask "docker-desktop"
cask "postico"
cask "datagrip"
cask "insomnia"

#: Work & Communication
cask "slack"
cask "whatsapp"
cask "mailmate"
cask "missive"
cask "figma"
cask "discord"
cask "signal"
cask "asana"
cask "notion"
cask "chatgpt"

#: Productivity & Utilities
cask "obsidian"
cask "spotify"
cask "google-drive"
cask "numi"

#: Security
cask "lulu"

#: Browsers
cask "firefox"
cask "google-chrome"
cask "vivaldi"
cask "zen-browser"

#: Fonts
cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-alegreya-sans-sc"
cask "font-alegreya-sc"
cask "font-blex-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-iosevka"
cask "font-victor-mono"
cask "font-hack-nerd-font"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-ibm-plex-mono"
cask "font-inter"

#: Mac App Store
brew "mas"
mas "Table Tool", id: 1122008420