# Taps
tap "aws/tap"
tap "candid82/brew"
tap "craciuncezar/tap"
tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "khanhas/tap"

#: Brews
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "automake"
brew "bat"
brew "cmake"
brew "coreutils"
brew "openssl@3"
brew "gcc"
brew "craciuncezar/tap/git-smart-checkout"
brew "readline"
brew "asdf"
brew "htop"
brew "sqlite"
brew "curl"
brew "fswatch"
brew "gnupg"
brew "awscli"
brew "lazygit"
brew "lazydocker"
brew "fzf"
brew "hub"
brew "neovim-remote"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "subversion"
brew "dprint"
brew "exa"
brew "jq"
brew "rsync"
brew "fd"
brew "the_silver_searcher"
brew "ripgrep"
brew "rust"
brew "go"
brew "svn"
brew "tree"
brew "zoxide"
brew "aws/tap/aws-sam-cli"
brew "wget"
brew "yarn"

#: Casks
cask "arq"
cask "dropbox"
cask "raycast"
cask "dropbox"
cask "kitty"
cask "brave-browser"
cask "alt-tab"
cask "discord"
cask "signal"
cask "mailmate"
cask "kaleidoscope"
cask "docker"
cask "firefox"
cask "figma"
cask "google-chrome"
cask "karabiner-elements"
cask "slack"
cask "kap"
cask "sketch"
cask "skype"
cask "steam"
cask "spotify"
cask "visual-studio-code"
#cask "1password"
#cask "1password-cli"
#cask "adobe-creative-cloud"

#: Fonts
cask "font-blex-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-victor-mono"
cask "font-iosevka"
cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-alegreya-sans-sc"
cask "font-alegreya-sc"

brew "mas"
mas "Table Tool", id: 1122008420
mas "Vimari", id: 1480933944
# mas "1Password 7", id: 1333542190
# mas "Xcode", id: 497799835
