tap "aws/tap"
tap "candid82/brew"
tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
:q
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "koekeishiya/formulae"

brew "automake"
brew "coreutils"
brew "openssl@1.1"
brew "readline"
brew "asdf"
brew "sqlite"
brew "curl"
brew "fswatch"
brew "gcc"
brew "gnupg"

brew "docker"
brew "awscli"
brew "bat"
brew "fzf"
brew "hub"
brew "gh"
brew "git"
brew "git-delta"
brew "dprint"
brew "exa"
brew "jq"
brew "rsync"
brew "fd"
brew "the_silver_searcher"
brew "ripgrep"
brew "rust"
brew "go"
brew "tree-sitter"
brew "tree"
brew "zoxide"
brew "aws/tap/aws-sam-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "wget"

cask "adobe-creative-cloud"
cask "1password"
cask "alfred"
cask "arq"
cask "font-blex-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-victor-mono"

cask "docker"
cask "firefox"
cask "google-chrome"
cask "jettison", args: { appdir: "/Applications" }
cask "karabiner-elements"
cask "kitty"
cask "postgres"
cask "sketch"
cask "skype"
cask "spotify"
cask "visual-studio-code"

brew "mas"
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Table Tool", id: 1122008420
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835

brew "whalebrew"
whalebrew "flomotlik/formica"
